
RELY_PARAMS = {
    "Очень низкий": 0.75,
    "Низкий": 0.86,
    "Номинальный": 1.00,
    "Высокий": 1.15,
    "Очень высокий": 1.40
}

DATA_PARAMS = {
    "Низкий": 0.94,
    "Номинальный": 1.00,
    "Высокий": 1.08,
    "Очень высокий": 1.16
}

CPLX_PARAMS = {
    "Очень низкий": 0.70,
    "Низкий": 0.85,
    "Номинальный": 1.00,
    "Высокий": 1.15,
    "Очень высокий": 1.30
}

TIME_PARAMS = {
    "Номинальный": 1.00,
    "Высокий": 1.11,
    "Очень высокий": 1.50
}

STOR_PARAMS = {
    "Номинальный": 1.00,
    "Высокий": 1.06,
    "Очень высокий": 1.21
}

VIRT_PARAMS = {
    "Низкий": 0.87,
    "Номинальный": 1.00,
    "Высокий": 1.15,
    "Очень высокий": 1.30
}

TURN_PARAMS = {
    "Низкий": 0.87,
    "Номинальный": 1.00,
    "Высокий": 1.07,
    "Очень высокий": 1.15
}

ACAP_PARAMS = {
    "Очень низкий": 1.46,
    "Низкий": 1.19,
    "Номинальный": 1.00,
    "Высокий": 0.86,
    "Очень высокий": 0.71
}

AEXP_PARAMS = {
    "Очень низкий": 1.29,
    "Низкий": 1.15,
    "Номинальный": 1.00,
    "Высокий": 0.91,
    "Очень высокий": 0.82
}


PCAP_PARAMS = {
    "Очень низкий": 1.42,
    "Низкий": 1.17,
    "Номинальный": 1.00,
    "Высокий": 0.86,
    "Очень высокий": 0.70
}

VEXP_PARAMS = {
    "Очень низкий": 1.21,
    "Низкий": 1.10,
    "Номинальный": 1.00,
    "Высокий": 0.90
}

LEXP_PARAMS = {
    "Очень низкий": 1.14,
    "Низкий": 1.07,
    "Номинальный": 1.00,
    "Высокий": 0.95
}

MODP_PARAMS = {
    "Очень низкий": 1.24,
    "Низкий": 1.10,
    "Номинальный": 1.00,
    "Высокий": 0.91,
    "Очень высокий": 0.82
}

TOOL_PARAMS = {
    "Очень низкий": 1.24,
    "Низкий": 1.10,
    "Номинальный": 1.00,
    "Высокий": 0.91,
    "Очень высокий": 0.82
}

SCED_PARAMS = {
    "Очень низкий": 1.23,
    "Низкий": 1.08,
    "Номинальный": 1.00,
    "Высокий": 1.04,
    "Очень высокий": 1.10
}

WORK_POWER = {
    "Обычный": 1.05,
    "Промежуточный": 1.12,
    "Встроенный": 1.20
}

WORK_MULTI = {
    "Обычный": 3.20,
    "Промежуточный": 3.00,
    "Встроенный": 2.80
}

WORK_FULL = 1.08

TIME_POWER = {
    "Обычный": 0.38,
    "Промежуточный": 0.35,
    "Встроенный": 0.32
}

TIME_MULTI = {
    "Обычный": 2.50,
    "Промежуточный": 2.50,
    "Встроенный": 2.50
}

TIME_FULL = 1.36

WBS_CONSTS = {
    "analysis": 4,
    "design": 12,
    "programming": 44,
    "testing": 6,
    "verification": 14,
    "documents": 7,
    "configuration": 7,
    "manual_creation": 6,
    "full": 100
}


TRADITIONAL_CONSTS = {
    "planning": (8, 36),
    "predesign": (18, 36),
    "design": (25, 18),
    "programming": (26, 18),
    "testing": (31, 28),
    "general": (100, 100),
    "full": (108, 136)
}
